Catalogs/КассыККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КассыККМ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезПодключенияОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКассы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКассККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыКассККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКассККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтономнаяККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМOffline</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьWebСервисОборудование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидТранспортаОфлайнОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаОфлайнОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДрайверОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрайверыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторWebСервисОборудования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Comment>Уникальный идентификатор устройства стандарта оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФорматноЛогическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОфлайнОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОфлайнОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПереустановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУстановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВерсияФорматаОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбработчикДрайвера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПризнакСпособаРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПризнакПредметаРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОбмена</Name>
					<Comment>Предназначен для обмена с оборудованием Offline</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСПодключаемымОборудованием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРегистрации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КассыККМ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьПодключаемоеОборудование = ПолучитьФункциональнуюОпцию("ИспользоватьПодключаемоеОборудование");
	//ИспользоватьОбменСПодключаемымОборудованием = ПолучитьФункциональнуюОпцию("ИспользоватьОбменСПодключаемымОборудованием");
	//ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если НЕ ИспользоватьПодключаемоеОборудование Тогда
		Элементы.ТипКассы.Доступность = Ложь;
		ТекстПодсказки = НСтр("ru = 'ККМ без подключения оборудования. 
								|Используется при применении автономного фискального регистратора 
								|или при продажах без обязательной печати фискального чека.
								|'");
	//ИначеЕсли ИспользоватьОбменСПодключаемымОборудованием Тогда
	//	Элементы.ТипКассы.СписокВыбора.Добавить(Перечисления.ТипыКассККМ.ККМOffline);
	//	ТекстПодсказки = НСтр("ru = 'ККТ с функцией передачи в ОФД, фискальный регистратор или АСПД, принтер чеков.
	//							|Используется при печати чека на устройстве, подключенном к системе, на фискальном регистраторе, 
	//							|АСПД (автоматизированной системе печати документов) или принтере чеков.
	//							|
	//							|ККМ без подключения оборудования.
	//							|Используется при применении автономного фискального регистратора
	//							|или при продажах без обязательной печати фискального чека.
	//							|
	//							|ККМ Офлайн.
	//							|Используется при продажах на ККМ в режиме Офлайн.
	//							|'");
	Иначе
		ТекстПодсказки = НСтр("ru = 'ККТ с функцией передачи в ОФД, фискальный регистратор или АСПД, принтер чеков. 
								|Используется при печати чека на устройстве, подключенном к системе, на фискальном регистраторе, 
								|АСПД (автоматизированной системе печати документов) или принтере чеков.
								|
								|ККМ без подключения оборудования.
								|Используется при применении автономного фискального регистратора 
								|или при продажах без обязательной печати фискального чека.
								|'");
	КонецЕсли;
	
	Элементы.ТипКассы.Подсказка = ТекстПодсказки;
		
	// Подсистема запрета редактирования ключевых реквизитов объектов.
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		//ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	Иначе
		УстановитьВидимостьПодключаемогоОборудования();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
		РабочееМестоПриИзменении(Неопределено);
	КонецЕсли;
	
	УстановитьВидимостьРабочегоМеста();
	
	СформироватьАвтоНаименование();
	ОбновитьПараметрыВыбораКассы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	//// СтандартныеПодсистемы.УправлениеДоступом
	//Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
	//	МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
	//	МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	//КонецЕсли;
	//// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьВидимостьПодключаемогоОборудования();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	//УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьВидимостьПодключаемогоОборудования();
	
	// Подсистема запрета редактирования ключевых реквизитов объектов.
	//ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	СформироватьАвтоНаименование();
КонецПроцедуры

&НаКлиенте
Процедура МагазинПриИзменении(Элемент)
	СформироватьАвтоНаименование();
КонецПроцедуры

&НаКлиенте
Процедура РабочееМестоПриИзменении(Элемент)
	
	РабочееМестоПриИзмененииСервер()
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКассыПриИзменении(Элемент)
	
	Объект.ИспользоватьБезПодключенияОборудования = Объект.ТипКассы = ПредопределенноеЗначение("Перечисление.ТипыКассККМ.АвтономнаяККМ");
	Объект.ПодключаемоеОборудование = ПредопределенноеЗначение("Справочник.ПодключаемоеОборудование.ПустаяСсылка");
	//Объект.ШаблонЧекаККМ = ПредопределенноеЗначение("Справочник.ХранилищеШаблонов.ПустаяСсылка");
	//Объект.ШаблонЧекаККМВозврат = ПредопределенноеЗначение("Справочник.ХранилищеШаблонов.ПустаяСсылка");
	//Объект.ШиринаЛенты = 0;
	
	//Если Объект.ТипКассы = ПредопределенноеЗначение("Перечисление.ТипыКассККМ.ФискальныйРегистратор") Тогда
	//	Объект.НастройкаРаспределенияВыручкиПоСекциям = ПредопределенноеЗначение("Справочник.НастройкиРаспределенияВыручкиПоСекциямФР.РаспределениеПоУмолчанию");
	//Иначе
	//	Объект.НастройкаРаспределенияВыручкиПоСекциям = ПредопределенноеЗначение("Справочник.НастройкиРаспределенияВыручкиПоСекциямФР.ПустаяСсылка");
	//КонецЕсли;
	ОбновитьПараметрыВыбораКассы();
	
	УстановитьВидимостьРабочегоМеста();
	УстановитьВидимостьПодключаемогоОборудования();
	
	Элементы.ПодключаемоеОборудование.ОтметкаНезаполненного = НЕ Объект.ИспользоватьБезПодключенияОборудования;
	//Элементы.РаспределениеВыручки.ОтметкаНезаполненного     = Объект.ТипКассы = ПредопределенноеЗначение("Перечисление.ТипыКассККМ.ФискальныйРегистратор");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемоеОборудованиеПриИзменении(Элемент)
	
	ПодключаемоеОборудованиеПриИзмененииСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьАвтоНаименование()
	
	Элементы.Наименование.СписокВыбора.Очистить();
	СтрокаНаименования = СокрЛП(Объект.Владелец) + "(" + СокрЛП(Объект.Магазин) + ")";
	
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыВыбораКассы()
	
	ПараметрыВыбораЭлемента = Новый Массив;
	Если Объект.ТипКассы = ПредопределенноеЗначение("Перечисление.ТипыКассККМ.ФискальныйРегистратор") Тогда
		Значения = Новый Массив;
		Значения.Добавить(ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ФискальныйРегистратор"));
		Значения.Добавить(ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ПринтерЧеков"));
		Значения.Добавить(ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККТ"));
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипОборудования", Значения);
		ПараметрыВыбораЭлемента.Добавить(НовыйПараметр);
		НастройкаШаблонов = Истина;
		
	//Иначе
	//	НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипОборудования", ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККМОфлайн"));
	//	ПараметрыВыбораЭлемента.Добавить(НовыйПараметр);
	//	НастройкаШаблонов = Ложь;
	КонецЕсли;
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.УстройствоИспользуется", Истина);
	ПараметрыВыбораЭлемента.Добавить(НовыйПараметр);
	
	Элементы.ПодключаемоеОборудование.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЭлемента);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемоеОборудованиеПриИзмененииСервер()
	
	//Объект.СерийныйНомер = Объект.ПодключаемоеОборудование.СерийныйНомер;
	Объект.ТипОборудования = Объект.ПодключаемоеОборудование.ТипОборудования;
	
	УстановитьВидимостьДопСвойств();
	
КонецПроцедуры

&НаСервере
Процедура РабочееМестоПриИзмененииСервер()
	
	УстановитьВидимостьПодключаемогоОборудования();
	ПодключаемоеОборудованиеПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДопСвойств()
	
	Видимость = Ложь;
	Если Объект.ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор Тогда
		Видимость = НЕ Объект.ИспользоватьБезПодключенияОборудования;
		//Элементы.РаспределениеВыручки.Видимость	= Видимость;
		//Элементы.ШаблонЧекаККМ.Видимость		= Видимость;
		//Элементы.ШаблонЧекаККМВозврат.Видимость	= Видимость;
		
		Если Объект.ПодключаемоеОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
			Элементы.Организация.Доступность = Ложь;
			//Элементы.ГруппаПечать.Доступность = Ложь;
			//Элементы.ЭлектронныйЧекSMSПередаютсяПрограммой1С.Видимость   = Истина;
			//Элементы.ЭлектронныйЧекEmailПередаютсяПрограммой1С.Видимость = Истина;
			
			Объект.Владелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПодключаемоеОборудование, "Организация");
			
			Элементы.Наименование.СписокВыбора.Очистить();
			СтрокаНаименования = СокрЛП(Объект.Владелец) + "(" + СокрЛП(Объект.Магазин) + ")";
			Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
			
		Иначе
			Элементы.Организация.Доступность = Истина;
			//Элементы.ГруппаПечать.Доступность = Истина;
			//Элементы.ЭлектронныйЧекSMSПередаютсяПрограммой1С.Видимость = Ложь;
			//Элементы.ЭлектронныйЧекEmailПередаютсяПрограммой1С.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.Организация.Доступность = Истина;
		//Элементы.ГруппаПечать.Доступность = Истина;
		//Элементы.РаспределениеВыручки.Видимость       = Ложь;
		//Элементы.ШаблонЧекаККМ.Видимость              = Ложь;
		//Элементы.ШаблонЧекаККМВозврат.Видимость       = Ложь;
		//Элементы.ЭлектронныйЧекSMSПередаютсяПрограммой1С.Видимость = Ложь;
		//Элементы.ЭлектронныйЧекEmailПередаютсяПрограммой1С.Видимость = Ложь;
	КонецЕсли;
	
	//УстановитьВидимостьШириныЛенты();
	//УстановитьВидимостьСоответствияВидовОплаты();
	
	
	//Если Видимость Тогда
	//	УстановитьДоступностьДопСвойств()
	//КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПодключаемогоОборудования()
	
	Элементы.ПодключаемоеОборудование.Видимость = ЗначениеЗаполнено(Объект.РабочееМесто) И НЕ Объект.ИспользоватьБезПодключенияОборудования;
	
	Элементы.ПодключаемоеОборудование.АвтоОтметкаНезаполненного = НЕ Объект.ИспользоватьБезПодключенияОборудования;
	
	//Элементы.РаспределениеВыручки.АвтоОтметкаНезаполненного     = Объект.ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор;
	
	УстановитьВидимостьДопСвойств();
	
	Если Элементы.ПодключаемоеОборудование.Видимость Тогда
		УстановитьДоступностьПодключаемогоОборудования()
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьРабочегоМеста()
	
	Если НЕ ЗначениеЗаполнено(Объект.РабочееМесто) Тогда
		Объект.РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
	КонецЕсли;
	Элементы.РабочееМесто.Видимость = Истина;
	Элементы.РабочееМесто.АвтоВыборНезаполненного = Истина;
	
	Если Элементы.РабочееМесто.Видимость Тогда
		УстановитьДоступностьРабочегоМеста()
	КонецЕсли
	
КонецПроцедуры

//&НаСервере
//Процедура УстановитьВидимостьСоответствияВидовОплаты()
//	
//	Элементы.СоответствиеВидовОплаты.Видимость = (Объект.ТипКассы = Перечисления.ТипыКассККМ.ККМOffline);
//	
//КонецПроцедуры

//&НаСервере
//Процедура УстановитьВидимостьШириныЛенты()
//	
//	Элементы.ШиринаЛенты.Видимость = НЕ Объект.ИспользоватьБезПодключенияОборудования 
//	И (Объект.ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор);
//	
//	Если Элементы.ШиринаЛенты.Видимость Тогда
//		УстановитьДоступностьШириныЛенты()
//	КонецЕсли
//	
//КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПодключаемогоОборудования()
	
	Элементы.ПодключаемоеОборудование.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Объект.РабочееМесто)
		ИЛИ Объект.ИспользоватьБезПодключенияОборудования;
	
	Элементы.ПодключаемоеОборудование.АвтоОтметкаНезаполненного = НЕ Объект.ИспользоватьБезПодключенияОборудования;
	
	//Элементы.РаспределениеВыручки.АвтоОтметкаНезаполненного     = Объект.ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРабочегоМеста()
	
	Если НЕ ЗначениеЗаполнено(Объект.РабочееМесто) Тогда
		Объект.РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
	КонецЕсли;
	Элементы.РабочееМесто.Доступность = Истина;
	Элементы.РабочееМесто.АвтоВыборНезаполненного = Истина;
	
КонецПроцедуры

//&НаСервере
//Процедура УстановитьДоступностьШириныЛенты()
//	
//	Элементы.ШиринаЛенты.ТолькоПросмотр = Объект.ИспользоватьБезПодключенияОборудования
//										  ИЛИ НЕ (Объект.ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор);
//	
//КонецПроцедуры

//&НаСервере
//Процедура УстановитьДоступностьДопСвойств()
//	Если Объект.ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор Тогда
//		Элементы.РаспределениеВыручки.ТолькоПросмотр = Объект.ИспользоватьБезПодключенияОборудования;
//		Элементы.ШаблонЧекаККМ.ТолькоПросмотр        = Объект.ИспользоватьБезПодключенияОборудования;
//		Элементы.ШаблонЧекаККМВозврат.ТолькоПросмотр = Объект.ИспользоватьБезПодключенияОборудования;
//	Иначе
//		Элементы.РаспределениеВыручки.ТолькоПросмотр = Истина;
//		Элементы.ШаблонЧекаККМ.ТолькоПросмотр        = Истина;
//		Элементы.ШаблонЧекаККМВозврат.ТолькоПросмотр = Истина;
//	КонецЕсли;
//	
//	УстановитьДоступностьШириныЛенты();
//	
//КонецПроцедуры

#КонецОбласти
